import os
from pathlib import Path


BASE_DIR = Path(__file__).resolve().parent

TRANSCRIPTION_MODEL = "openai/whisper-large-v3"
TRANSCRIPTION_LANGUAGE = "uk"
MODEL_CACHE_DIR = os.getenv("MODEL_CACHE_DIR", str(BASE_DIR / "model"))
STRUCTURING_MODEL = os.getenv("STRUCTURING_MODEL", "gpt-5-nano")
STRUCTURE_LANGUAGE = "Ukranian"

BACKEND_BASE_URL = os.getenv("BACKEND_BASE_URL", "http://127.0.0.1:8000")
DATABASE_URL = os.getenv(
    "DATABASE_URL",
    "postgresql+psycopg2://postgres:postgres@127.0.0.1:5432/medical_documents",
)

USE_TEST_TRANSCRIPT_STUB = True

TEST_TRANSCRIPT_STUB = """Лікар: Добрий день, мене звати Софія Петрівіна і я лікар-терапевт. Чим я можу вам допомогти?

Пацієнт: Добрий день, лікарю. Мене звати Павло Іванович, мені 35 років і я чоловік. Я прийшов до вас із запитом, що мене сильно болить голова. Що ви можете мені порадити? Підкажіть, будь ласка, коли це все розпочалось? Це почалося близько двох років тому. Це був сіквел. Зрозуміло, підкажіть, будь ласка.

Лікар: чи були якісь ушкодження голови внаслідок ДТП?

Пацієнт: Сильних ушкоджень голови в мене не було. Я думав, що зі мною все гаразд. Проте, як виявилося, час від часу, коли температура опускалася, нижчі 20 градусів Цельсія, мене болить сильно голова.

Лікар: Зрозуміло. Підкажи, будь ласка, чи ви зараз приймаєте якісь препарати або бади?

Пацієнт: Я приймаю препарати саме ібупрофен, Зрозуміло.

Лікар: Як довго ви вже приймаєте ібупрофен для зняття симптоматики головного болю?

Пацієнт: Я приймаю ібупрофен близько одного року.

Лікар: Це дуже довге використання ібупрофену? я пропоную вам його вже замінити на інші препарати, а також обстежити ваш шлунок, оскільки бупрофен дуже негативно на нього впливає. Зараз для полегшення симптомів головного болю можете використовувати парацетамол, а також рекомендую більше прогулянок на свіжому повітрі, звернутися до офтальмолога, а також провести комп'ютерну томографію, щоб виключити наявність серйозних ушкоджень черепа чи мозку.

Пацієнт: Дякую, Юлія.

Лікар: Я підсумую, що мені треба зробити комп'ютерну томографію черепа, зробити автоматичне обстеження для очного тиску та здати аналіз крові.

Пацієнт: Добре, лікарю, дякую. Піду це робити. До побачення.

Лікар: Гарного дня, до побачення."""
